---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.ResetCellOverride(System.Int32)
source: html/795e9408-e538-9ee3-78da-0c9822280c2b.htm
---
# Autodesk.Revit.DB.TableSectionData.ResetCellOverride Method

Resets the override of the column.

## Syntax (C#)
```csharp
public void ResetCellOverride(
	int nCol
)
```

## Parameters
- **nCol** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The given column number nCol is invalid.